<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"7caf8e5bc2cfb94ac88f5d416de468480d9401c42cafdc50990af1b176638170","plan_job_ref":"Job Terraform Plan #66 at https://github.com/cal-itp/data-infra/actions/runs/14412165154","plan_out_hash":"08d32ed0da458a35a2dc650be0834fce8a1bd148833983dde433a8cd681a73cd","plan_hash":"fd4e6db472ec5a5186ab5777dcb9bd49b510b2b4a5bd7743e44c892edbf7282c","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __iac/cal-itp-data-infra/gcs/us__
<details>
<summary>Plan: 1 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy

Terraform will perform the following actions:

  # google_storage_bucket.calitp-dbt-docs will be created
+   resource "google_storage_bucket" "calitp-dbt-docs" {
+       default_event_based_hold    = false
+       force_destroy               = true
+       id                          = (known after apply)
+       location                    = "US-WEST2"
+       name                        = "calitp-dbt-docs"
+       project                     = "cal-itp-data-infra"
+       public_access_prevention    = "inherited"
+       requester_pays              = false
+       self_link                   = (known after apply)
+       storage_class               = "STANDARD"
+       uniform_bucket_level_access = true
+       url                         = (known after apply)

+       versioning (known after apply)

+       website {
+           main_page_suffix = "index.html"
        }
    }

  # google_storage_bucket_acl.tfer--calitp-jamesl-gcp-components-tfstate will be destroyed
  # (because google_storage_bucket_acl.tfer--calitp-jamesl-gcp-components-tfstate is not in configuration)
-   resource "google_storage_bucket_acl" "tfer--calitp-jamesl-gcp-components-tfstate" {
-       bucket      = "calitp-jamesl-gcp-components-tfstate" -> null
-       id          = "calitp-jamesl-gcp-components-tfstate" -> null
-       role_entity = [] -> null
    }

  # google_storage_bucket_acl.tfer--cold-storage-outputs-gtfs-data-test-charlie-test will be destroyed
  # (because google_storage_bucket_acl.tfer--cold-storage-outputs-gtfs-data-test-charlie-test is not in configuration)
-   resource "google_storage_bucket_acl" "tfer--cold-storage-outputs-gtfs-data-test-charlie-test" {
-       bucket      = "cold-storage-outputs-gtfs-data-test-charlie-test" -> null
-       id          = "cold-storage-outputs-gtfs-data-test-charlie-test" -> null
-       role_entity = [] -> null
    }

Plan: 1 to add, 0 to change, 2 to destroy.

Changes to Outputs:
+   google_storage_bucket_calitp-dbt-docs_name                                                                 = "calitp-dbt-docs"
```
</details>

:memo: Plan generated in [Terraform Plan #66](https://github.com/cal-itp/data-infra/actions/runs/14412165154)